Model Name: BiLSTM Learned Embeddings (2)
Training File: ./data/raw/OffensEval2019/start-kit/training-v1/offenseval-training-v1.tsv
Dropout Amount: [0.2, 0.2, 0.2, 0.2]
Regularization Amount: []
Units: [10, 4, 1]
Activation Functions: ['relu', 'sigmoid']
Optimizer: adam
Loss Function: binary_crossentropy
Metric: ['accuracy']
Epochs: 20
Batch Size: 512
Dropout Amount: [0.2, 0.2, 0.2, 0.2]
Model Details:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, None, 300)         6555600   
_________________________________________________________________
bidirectional_1 (Bidirection (None, 20)                24880     
_________________________________________________________________
dropout_1 (Dropout)          (None, 20)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 84        
_________________________________________________________________
activation_1 (Activation)    (None, 4)                 0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 4)                 0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 5         
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 6,580,569
Trainable params: 6,580,569
Non-trainable params: 0
_________________________________________________________________
